InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеШтрихкода</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ххх_НоменклатураЗапрещеноЗаводитьШтрихкода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ххх_НоменклатураЗапрещеноЗаводитьШтрихкода</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Штрихкоды/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура КочетовТипШтрихкодаНачалоВыбораПеред(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КочетовПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	Отказ=ПроверитьЗаполнениеТипаШтрихКода(Отказ);	
	Отказ=ПроверитьРазрешениенаЗапись(Отказ);	
КонецПроцедуры


Функция ПроверитьРазрешениенаЗапись(Отказ)
	Запрос=Новый запрос;
	запрос.УстановитьПараметр("номка",запись.Владелец);
	наб=РегистрыСведений.ххх_НоменклатураЗапрещеноЗаводитьШтрихкода.СоздатьНаборЗаписей();
	наб.Прочитать();
	запрос.УстановитьПараметр("ИсключенныеПапки",наб.ВыгрузитьКолонку("номенклатура"));
	Запрос.Текст="ВЫБРАТЬ
	             |	Номенклатура.Ссылка КАК Ссылка
	             |ПОМЕСТИТЬ йцу
	             |ИЗ
	             |	Справочник.Номенклатура КАК Номенклатура
	             |ГДЕ
	             |	Номенклатура.Ссылка = &номка
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	йцу.Ссылка КАК Ссылка
	             |ИЗ
	             |	йцу КАК йцу
	             |ГДЕ
	             |	йцу.Ссылка В ИЕРАРХИИ(&ИсключенныеПапки)";
	выборка=Запрос.Выполнить().Выбрать();
	Если выборка.Следующий() Тогда
		сообщить("Да данную карточку запрещенно заводить штрихкоды!");
		возврат истина;
	Иначе
		возврат отказ;
	КонецЕсли;
КонецФункции


Функция ПолучитьМассивТиповШтрихКодов ()
	Массив= Новый Массив;
	Массив.Добавить(ПланыВидовХарактеристик.ТипыШтрихкодов.EAN8);
	Массив.Добавить(ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13);
	Массив.Добавить(Справочники.ххх_Справочник.НашШтрихкод.Значение);
 	возврат массив
КонецФункции

Функция	ПроверитьЗаполнениеТипаШтрихКода(Отказ);
	Если Не значениеЗаполнено(Запись.ТипШтрихкода) 
		или не
		(
		Запись.ТипШтрихкода=ПланыВидовХарактеристик.ТипыШтрихкодов.EAN8 
		или Запись.ТипШтрихкода=ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13
		или Запись.ТипШтрихкода=Справочники.ххх_Справочник.НашШтрихкод.Значение 
		)
		Тогда
			Отказ=Истина;
			Сообщить("Не заполнен тип штрихкода.");
		КонецЕсли;
	возврат отказ;
КонецФункции

&НаКлиенте
Процедура КочетовПриОткрытииПосле(Отказ)
	// Вставить содержимое обработчика.
	Элементы.ТипШтрихкода.СписокВыбора.ЗагрузитьЗначения(ПолучитьМассивТиповШтрихКодов());
	Элементы.ТипШтрихкода.СписокВыбора.НайтиПоЗначению(запись.ТипШтрихкода);
КонецПроцедуры

&НаКлиенте
Процедура КочетовВладелецНачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=ложь;
	струк=новый структура;
	струк.Вставить("РазрешеныЗакупки",истина);
	параметры1=Новый Структура;
	параметры1.Вставить("Отбор",струк);
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбора",параметры1,элемент,истина,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	// Вставить содержимое обработчика.
КонецПроцедуры
